TrainCase/case2/0/Fs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Fs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0
0.00393019
0
2.94267e-05
0.0850029
0
4.71045e-05
4.02565e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
6.61775e-05
7.81157e-05
1.12474e-05
4.25856e-05
8.54116e-05
5.56558e-05
4.16467e-05
5.57538e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 4.53979e-05;
    }
}


// ************************************************************************* //
