TrainCase/case2/0/I2_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
-4.8652e-06
2.15121e-12
-0.000458121
2.30092e-16
-2.26954e-05
-1.55149e-05
-5.56348e-11
2.09499e-10
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
-9.05771e-05
2.42182e-12
-1.23199e-10
1.51782e-16
-7.62503e-11
-1.28998e-16
-1.08454e-10
-7.34408e-17
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-1.67746e-118
1.90309e-118
-4.03472e-115
5.07051e-114
-3.46784e-115
3.78447e-114
-4.77954e-113
4.08055e-117
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.0116745
-0.0109958
-0.0225356
-0.0114371
-0.0159687
-0.0121596
-0.0162379
-0.0121978
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
-9.69242e-116
8.80691e-119
-3.00105e-116
5.45741e-115
-3.62699e-114
8.94166e-115
-6.5199e-113
1.54944e-113
...
)
;
    }
}


// ************************************************************************* //
