TrainCase/case2/0/I2_3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.000287524
3.16695e-06
0.00598322
2.19745e-07
0.000800389
0.00930507
1.45735e-07
0.000108684
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.00202308
3.85481e-06
2.47592e-07
1.63225e-07
1.79816e-07
2.05463e-07
2.27421e-07
2.38764e-07
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.97565e-79
9.17288e-79
4.6049e-77
8.15677e-75
2.43326e-77
9.58846e-75
1.22135e-75
1.71674e-79
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0495723
0.0566993
0.0789628
0.0592891
0.0609914
0.0611079
0.0615767
0.0612406
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
6.82167e-78
3.88859e-81
7.39898e-79
6.07598e-77
2.35859e-76
1.02589e-76
7.52697e-76
2.1568e-76
...
)
;
    }
}


// ************************************************************************* //
