TrainCase/case2/0/I2_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
4.48264e-11
0.00134754
8.40017e-10
1039.47
3.50009e-06
1.04255e-08
7.88171
0.0236555
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.1866e+142
6.98843e+140
2.76213e+139
6.94811e+136
4.03006e+135
6.19253e+131
7.14128e+129
9.95089e+130
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
66964.5
19845
376.45
0
0
0
0
102651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.71617e-16
2.93833e-09
8.96922e-13
2.55697e-05
3.21979e-10
3.22099e-10
1.82119e-08
1.93665e-08
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0
0
3948.02
44.1416
0
0
0
8.885
...
)
;
    }
}


// ************************************************************************* //
