TrainCase/case2/0/Rew
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Rew;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.707536
0.38036
0.999985
0.207823
0.994333
1
0.187739
0.923791
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.22734e-19
1.90819e-20
9.33722e-21
8.40439e-21
8.62961e-21
8.93975e-21
9.18447e-21
9.30783e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.07811e-09
5.68763e-09
1.2797e-08
3.94623e-08
7.79567e-09
2.93596e-08
1.48264e-08
1.36462e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
2.0653e-08
3.1901e-09
1.18447e-08
3.56482e-08
5.003e-08
4.06265e-08
6.68633e-08
4.89232e-08
...
)
;
    }
}


// ************************************************************************* //
