TrainCase/case2/0/Sp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Sp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<symmTensor> 
39402
(
(-494181 1.57812e+07 0 801855 0 -307674)
(-19359.1 5.41412e+06 0 12763.7 0 6595.39)
(-496396 1.16561e+07 0 771689 0 -275294)
(-2981.69 3.31629e+06 0 3603.65 0 -621.961)
(-35406.8 4.92542e+06 0 23603.3 0 11803.5)
(-428745 7.89087e+06 0 664807 0 -236061)
(-0.985518 3.10123e+06 0 -51.2154 0 52.201)
(-6534.7 3.13456e+06 -3.51644e-17 6712.61 -1.29201e-20 -177.909)
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
398
(
(-510583 2.99524e+07 0 834659 0 -324076)
(-21219.1 5.70505e+06 0 16483.6 0 4735.44)
(-2512.34 3.41998e+06 0 2664.96 0 -152.614)
(50.3033 3.19296e+06 0 -153.793 0 103.49)
(223.666 3.36855e+06 0 -179.248 0 -44.418)
(173.507 3.51002e+06 4.45564e-17 -159.855 -1.50514e-21 -13.6515)
(134.303 3.59866e+06 0 -158.982 0 24.6795)
(39.3219 3.64986e+06 0 -23.1538 0 -16.168)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(1.28101e-13 2.10203e-12 0 -2.56202e-13 0 1.28101e-13)
(-4.32114e-13 2.78528e-12 0 8.64227e-13 0 -4.32114e-13)
(-1.33352e-12 -7.41392e-12 0 2.66703e-12 -1.26984e-30 -1.33352e-12)
(7.47976e-13 -2.70472e-11 0 -1.49595e-12 -1.0434e-31 7.47976e-13)
(2.89606e-12 6.32105e-12 0 -5.79211e-12 3.21852e-31 2.89606e-12)
(5.96004e-13 2.81631e-11 0 -1.19201e-12 -2.25614e-31 5.96004e-13)
(-1.94079e-12 1.68249e-11 0 3.88159e-12 0 -1.94079e-12)
(-4.62518e-12 -1.83197e-12 0 9.25036e-12 0 -4.62518e-12)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(-7.45318e+06 2.53682e+06 -5.01083e-15 7.19696e+06 -3.38335e-15 256218)
(-2.84509e+06 967981 -1.50507e-15 2.74756e+06 -1.01716e-15 97527.1)
(-2.54601e+06 1.33676e+06 1.65267e-10 2.716e+06 1.11469e-10 -169987)
(-1.40161e+06 576574 -1.5464e-10 1.40685e+06 -1.04302e-10 -5243.87)
(-1.14127e+06 388448 -1.20822e-16 1.10204e+06 -8.20474e-17 39230.4)
(-887619 337615 0 877530 0 10088.8)
(-724893 297072 -1.75291e-10 728399 -1.18257e-10 -3505.76)
(-623141 237041 1.6532e-10 616042 1.1153e-10 7098.57)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
398
(
(-3.23061e-12 -4.59955e-12 0 6.46121e-12 0 -3.23061e-12)
(-4.51478e-12 -7.10707e-13 0 9.02957e-12 1.12737e-27 -4.51478e-12)
(-5.97747e-12 -2.63958e-12 0 1.19549e-11 -1.12096e-27 -5.97747e-12)
(-2.84319e-12 -7.94597e-12 0 5.68638e-12 -8.49906e-29 -2.84319e-12)
(1.3448e-13 -1.11534e-11 0 -2.68959e-13 -9.32498e-29 1.3448e-13)
(2.80079e-12 -9.05769e-12 0 -5.60158e-12 -1.46672e-29 2.80079e-12)
(7.2984e-12 -1.49073e-11 0 -1.45968e-11 -9.01348e-28 7.2984e-12)
(8.04087e-12 1.09067e-11 0 -1.60817e-11 3.63968e-28 8.04087e-12)
...
)
;
    }
}


// ************************************************************************* //
