TrainCase/case2/0/TuM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TuM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.164982
0.038079
0.0740932
0.02316
0.0155855
0.0449311
0.0217417
0.00918188
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.152145;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.151417
0.19697
0.214902
0.213748
0.215398
0.214811
0.216036
0.215787
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.152145;
    }
}


// ************************************************************************* //
