TrainCase/case2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "6700";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
39402
(
(300.43 5.81125 0)
(57.3086 0.0590054 0)
(583.707 16.5002 0)
(34.2805 0.0141211 0)
(160.771 0.202615 0)
(772.858 27.0569 0)
(31.971 -0.00128808 0)
(98.8959 0.070776 0)
...
)
;

boundaryField
{
    base
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1484 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (1484 0 0);
    }
}


// ************************************************************************* //
