TrainCase/case2/0/lambda1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.0339854
0.00355889
0.155124
0.000937537
0.0565712
0.193736
0.000763505
0.0208502
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.0900082
0.00392643
0.000995169
0.000808021
0.000848095
0.000906561
0.000953774
0.00097727
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.10922e-39
2.12297e-39
1.55477e-38
1.81251e-37
1.91847e-38
1.96236e-37
7.4081e-38
2.45979e-38
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.446025
0.476953
0.564105
0.486995
0.49465
0.494476
0.496306
0.495012
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.68201e-38
2.27728e-38
4.14205e-38
2.45716e-38
3.07355e-38
2.89732e-38
1.14056e-37
1.01212e-37
...
)
;
    }
}


// ************************************************************************* //
