TrainCase/case2/0/lambda2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
-0.0339131
-0.00355919
-0.154703
-0.000937539
-0.0565823
-0.192926
-0.000763506
-0.0208503
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
-0.0899574
-0.00392673
-0.000995172
-0.000808022
-0.000848095
-0.000906561
-0.000953774
-0.00097727
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-1.09099e-39
-1.9155e-39
-1.35719e-38
-1.8063e-37
-9.86561e-39
-1.95841e-37
-6.98958e-38
-8.2867e-40
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.445297
-0.476232
-0.562007
-0.486987
-0.493929
-0.4944
-0.496293
-0.494937
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
-5.22366e-39
-1.24717e-40
-1.72035e-39
-1.55897e-38
-3.07154e-38
-2.02572e-38
-5.48706e-38
-2.93721e-38
...
)
;
    }
}


// ************************************************************************* //
