TrainCase/case2/0/nk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nk;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.0482551
0.0533766
0.0028712
0.0534497
0.00132588
0.000579854
0.0540776
0.00113905
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.000272374;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.036852
0.0469966
0.0411575
0.0364234
0.0334355
0.0312771
0.0295242
0.028143
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.000272374;
    }
}


// ************************************************************************* //
