TrainCase/case2/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.000634164
0.000482238
0.000703702
0.000558565
0.000574947
0.000661927
0.000578581
0.000628373
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.000345123
0.000422838
0.00051799
0.000537283
0.000552036
0.000555264
0.000554116
0.000554553
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 3.18865e-05;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.88309e-05
2.51306e-05
3.01052e-05
3.1774e-05
3.22125e-05
3.34492e-05
3.35443e-05
3.41905e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 3.18865e-05;
    }
}


// ************************************************************************* //
