TrainCase/case2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "6700";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
1.09855e+09
1.34101e+09
2.8247e+08
1.64978e+09
2.48011e+08
1.58247e+08
1.71487e+09
2.91855e+08
...
)
;

boundaryField
{
    base
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           nonuniform List<scalar> 
398
(
1.09855e+09
1.34101e+09
1.64978e+09
1.71487e+09
1.76465e+09
1.77667e+09
1.77446e+09
1.77725e+09
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
}


// ************************************************************************* //
