TrainCase/case2/0/p1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
4.35513e-08
7.17562e-09
7.844e-08
3.49146e-09
1.67018e-08
8.32339e-08
3.15204e-09
8.09123e-09
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
9.10291e-15
7.45707e-15
6.06141e-15
5.83135e-15
5.66685e-15
5.62851e-15
5.63552e-15
5.62667e-15
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.73205e-08;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
7.7178e-07
2.80395e-06
4.3622e-06
6.58559e-06
8.73608e-06
1.10735e-05
1.3502e-05
1.59783e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1.73205e-08;
    }
}


// ************************************************************************* //
