TrainCase/case2/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "6700";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.0372326
0.0400204
0.0350363
0.0337252
0.0361988
0.0362214
0.0325393
0.0315397
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.0528235
0.0431149
0.0351949
0.0339311
0.0330243
0.0328323
0.0329003
0.0328744
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.135517;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.895557
0.971201
0.872837
0.845277
0.838437
0.819826
0.818423
0.809158
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.135517;
    }
}


// ************************************************************************* //
